//********************
// WEB, JS, Angular
//********************
// 1. Что в разработке ПО означает 'story point' ?
// 2. BEM(БЭМ) что это ?
// 3. Как вы понимаете что такое API ?
// 4. Что такое JSX ?
// 5. Что такое и зачем нужен режим 'strict mode', примеры поведения кода в 2-х режимах ?
// 6. Что такое абстрактный класс ?
// 7. Зачем нужен декоратор @Attribute() ?
// 8. Жизненные циклы компонента в Angular в порядке вызова
// 9. Как вы понимаете, чем framework отличается от библиотеки ?
// 10. Что такое и зачем нужна NgZone.runOutsideAngular() ?
// 11. Что такое WebWorkers ?
